# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 5 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024] # YOLOv8n summary: 225 layers,  3157200 parameters,  3157184 gradients,   8.9 GFLOPs
  s: [0.33, 0.50, 1024] # YOLOv8s summary: 225 layers, 11166560 parameters, 11166544 gradients,  28.8 GFLOPs
  m: [0.67, 0.75, 768] # YOLOv8m summary: 295 layers, 25902640 parameters, 25902624 gradients,  79.3 GFLOPs
  l: [1.00, 1.00, 512] # YOLOv8l summary: 365 layers, 43691520 parameters, 43691504 gradients, 165.7 GFLOPs
  x: [1.00, 1.25, 512] # YOLOv8x summary: 365 layers, 68229648 parameters, 68229632 gradients, 258.5 GFLOPs

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  # MBConv arg = [out_channels,expand_ratio,kernel,stride,num_layers,stage_block_id,total_stage_block]
  - [-1, 1, Conv, [32, 3, 2]]

  - [-1, 1, MBConv, [16, 1, 3, 1, 1, 0, 23]]
  - [-1, 1, MBConv, [16, 1, 3, 1, 1, 1, 23]]

  - [-1, 1, MBConv, [24, 6, 3, 2, 1, 2, 23]]
  - [-1, 1, MBConv, [24, 6, 3, 1, 1, 3, 23]]
  - [-1, 1, MBConv, [24, 6, 3, 1, 1, 4, 23]]

  - [-1, 1, MBConv, [40, 6, 5, 2, 1, 5, 23]]
  - [-1, 1, MBConv, [40, 6, 5, 1, 1, 6, 23]]
  - [-1, 1, MBConv, [40, 6, 5, 1, 1, 7, 23]]

  - [-1, 1, MBConv, [80, 6, 3, 2, 1, 8, 23]]
  - [-1, 1, MBConv, [80, 6, 3, 1, 1, 9, 23]]
  - [-1, 1, MBConv, [80, 6, 3, 1, 1, 10, 23]]
  - [-1, 1, MBConv, [80, 6, 3, 1, 1, 11, 23]]

  - [-1, 1, MBConv, [112, 6, 5, 1, 1, 12, 23]]
  - [-1, 1, MBConv, [112, 6, 5, 1, 1, 13, 23]]
  - [-1, 1, MBConv, [112, 6, 5, 1, 1, 14, 23]]
  - [-1, 1, MBConv, [112, 6, 5, 1, 1, 15, 23]]

  - [-1, 1, MBConv, [192, 6, 5, 2, 1, 16, 23]]
  - [-1, 1, MBConv, [192, 6, 5, 1, 1, 17, 23]]
  - [-1, 1, MBConv, [192, 6, 5, 1, 1, 18, 23]]
  - [-1, 1, MBConv, [192, 6, 5, 1, 1, 19, 23]]
  - [-1, 1, MBConv, [192, 6, 5, 1, 1, 20, 23]]

  - [-1, 1, MBConv, [320, 6, 3, 1, 1, 21, 23]]
  - [-1, 1, MBConv, [320, 6, 3, 1, 1, 22, 23]]


# YOLOv8.0n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 24
  - [[-1, 16], 1, Concat, [1]] # 25 cat backbone P4
  - [-1, 3, C2f, [192]] # 26

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 27
  - [[-1, 8], 1, Concat, [1]] # 28 cat backbone P3
  - [-1, 3, C2f, [112]] # 29 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]] # 30
  - [[-1, 26], 1, Concat, [1]] # 31 cat head P4
  - [-1, 3, C2f, [192]] # 32 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]] # 33
  - [[-1, 23], 1, Concat, [1]] # 34 cat head P5
  - [-1, 3, C2f, [320]] # 35 (P5/32-large)

  - [[29, 32, 35], 1, Detect, [nc]] # 36 Detect(P3, P4, P5)