# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 5 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024] # YOLOv8n summary: 225 layers,  3157200 parameters,  3157184 gradients,   8.9 GFLOPs
  s: [0.33, 0.50, 1024] # YOLOv8s summary: 225 layers, 11166560 parameters, 11166544 gradients,  28.8 GFLOPs
  m: [0.67, 0.75, 768] # YOLOv8m summary: 295 layers, 25902640 parameters, 25902624 gradients,  79.3 GFLOPs
  l: [1.00, 1.00, 1024] # YOLOv8l summary: 365 layers, 43691520 parameters, 43691504 gradients, 165.7 GFLOPs
  x: [1.00, 1.25, 512] # YOLOv8x summary: 365 layers, 68229648 parameters, 68229632 gradients, 258.5 GFLOPs

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  # MBConv arg = [out_channels,expand_ratio,kernel,stride,num_layers,stage_block_id,total_stage_block]
  - [-1, 1, Conv, [32, 3, 2]]

  - [-1, 1, MBConv, [24, 1, 3, 1, 1, 0, 32]]
  - [-1, 1, MBConv, [24, 1, 3, 1, 1, 1, 32]]

  - [-1, 1, MBConv, [32, 6, 3, 2, 1, 2, 32]]
  - [-1, 1, MBConv, [32, 6, 3, 1, 1, 3, 32]]
  - [-1, 1, MBConv, [32, 6, 3, 1, 1, 4, 32]]
  - [-1, 1, MBConv, [32, 6, 3, 1, 1, 5, 32]]

  - [-1, 1, MBConv, [56, 6, 5, 2, 1, 6, 32]]
  - [-1, 1, MBConv, [56, 6, 5, 1, 1, 7, 32]]
  - [-1, 1, MBConv, [56, 6, 5, 1, 1, 8, 32]]
  - [-1, 1, MBConv, [56, 6, 5, 1, 1, 9, 32]]

  - [-1, 1, MBConv, [112, 6, 3, 2, 1, 10, 32]]
  - [-1, 1, MBConv, [112, 6, 3, 1, 1, 11, 32]]
  - [-1, 1, MBConv, [112, 6, 3, 1, 1, 12, 32]]
  - [-1, 1, MBConv, [112, 6, 3, 1, 1, 13, 32]]
  - [-1, 1, MBConv, [112, 6, 3, 1, 1, 14, 32]]
  - [-1, 1, MBConv, [112, 6, 3, 1, 1, 15, 32]]

  - [-1, 1, MBConv, [160, 6, 5, 1, 1, 16, 32]]
  - [-1, 1, MBConv, [160, 6, 5, 1, 1, 17, 32]]
  - [-1, 1, MBConv, [160, 6, 5, 1, 1, 18, 32]]
  - [-1, 1, MBConv, [160, 6, 5, 1, 1, 19, 32]]
  - [-1, 1, MBConv, [160, 6, 5, 1, 1, 20, 32]]
  - [-1, 1, MBConv, [160, 6, 5, 1, 1, 21, 32]]

  - [-1, 1, MBConv, [272, 6, 5, 2, 1, 22, 32]]
  - [-1, 1, MBConv, [272, 6, 5, 1, 1, 23, 32]]
  - [-1, 1, MBConv, [272, 6, 5, 1, 1, 24, 32]]
  - [-1, 1, MBConv, [272, 6, 5, 1, 1, 25, 32]]
  - [-1, 1, MBConv, [272, 6, 5, 1, 1, 26, 32]]
  - [-1, 1, MBConv, [272, 6, 5, 1, 1, 27, 32]]
  - [-1, 1, MBConv, [272, 6, 5, 1, 1, 28, 32]]
  - [-1, 1, MBConv, [272, 6, 5, 1, 1, 29, 32]]

  - [-1, 1, MBConv, [448, 6, 3, 1, 1, 30, 32]]
  - [-1, 1, MBConv, [448, 6, 3, 1, 1, 31, 32]]

# YOLOv8.0n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 17
  - [[-1, 22], 1, Concat, [1]] # 18 cat backbone P4
  - [-1, 3, C2f, [272]] # 35

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 20
  - [[-1, 10], 1, Concat, [1]] # 21 cat backbone P3
  - [-1, 3, C2f, [160]] # 38 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]] # 23
  - [[-1, 35], 1, Concat, [1]] # 24 cat head P4
  - [-1, 3, C2f, [272]] # 41 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]] # 26
  - [[-1, 32], 1, Concat, [1]] # 27 cat head P5
  - [-1, 3, C2f, [448]] # 44 (P5/32-large)

  - [[38, 41, 44], 1, Detect, [nc]] # 45 Detect(P3, P4, P5)